results/runs/ycsb/2026-05-17T09-36-47/redis/load_workload_f.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 09:33:27:578 0 sec: 0 operations; est completion in 0 second 
2026-05-17 09:33:36:350 8 sec: 100000 operations; 11348.16 current ops/sec; [CLEANUP: Count=10, Max=1784, Min=43, Avg=243.8, 90=218, 99=1784, 99.9=1784, 99.99=1784] [INSERT: Count=100000, Max=10823, Min=174, Avg=870.25, 90=1168, 99=1857, 99.9=4311, 99.99=8887] 
[OVERALL], RunTime(ms), 8812
[OVERALL], Throughput(ops/sec), 11348.161597821152
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 49
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5560599182932365
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 49
[TOTAL_GC_TIME_%], Time(%), 0.5560599182932365
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 243.8
[CLEANUP], MinLatency(us), 43
[CLEANUP], MaxLatency(us), 1784
[CLEANUP], 95thPercentileLatency(us), 1784
[CLEANUP], 99thPercentileLatency(us), 1784
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 870.25256
[INSERT], MinLatency(us), 174
[INSERT], MaxLatency(us), 10823
[INSERT], 95thPercentileLatency(us), 1296
[INSERT], 99thPercentileLatency(us), 1857
[INSERT], Return=OK, 100000